bierner.markdown-mermaid
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
DotJoshJohnson.xml
eamodio.gitlens
esbenp.prettier-vscode
GitHub.copilot
mhutchie.git-graph
mine.cpplint
ms-azuretools.vscode-docker
ms-iot.vscode-ros
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode.cpptools
oderwat.indent-rainbow
shardulm94.trailing-spaces
streetsidesoftware.code-spell-checker
twxs.cmake
wengerk.highlight-bad-chars
yzhang.markdown-all-in-one
